/* (No Comment) */
"30 FPS" = "30 FPS";

/* (No Comment) */
"60 FPS" = "60 FPS";

/* (No Comment) */
"Ask Us A Question" = "Esitä Kysymys";

/* (No Comment) */
"Authorization Error" = "Valtuutusvirhe";

/* (No Comment) */
"CancelTitle" = "Peruuta";

/* (No Comment) */
"Check For Updates" = "Tarkasta päivitysten varalta";

/* Confirm Password */
"Confirm Password" = "Vahvista salasana";

/* CONNECT */
"CONNECT" = "YHDISTÄ";

/* (No Comment) */
"Connect device to Mac with" = "Yhdistä laite Maciin tällä";

/* No comment provided by engineer. */
"Connected For %d Minutes" = "%d minuuttia yhdistettynä";

/* No comment provided by engineer. */
"Connected For 1 Minute" = "1 minuutti yhdistettynä";

/* No comment provided by engineer. */
"Connected For Less Than A Minute" = "Alle minuutti yhdistettynä";

/* No comment provided by engineer. */
"Connecting..." = "Yhdistetään...";

/* Discovered Devices */
"Discovered Devices" = "Löydetyt laitteet";

/* (No Comment) */
"Discrete (Recommended)" = "Erillinen (Suositeltu)";

/* No comment provided by engineer. */
"Display" = "Näyttö";

/* (No Comment) */
"Display Arrangement" = "Näyttöjen Järjestely";

/* Duet Connected */
"Duet Connected" = "Duet on Yhdistetty";

/* Email */
"Email" = "Sähköpostiosoite";

/* Email - Please enter a valid email */
"Email Error" = "Sähköpostiosoite – Anna kelvollinen osoite";

/* Energy Efficient */
"Energy Efficient" = "Energiatehokas";

/* (No Comment) */
"Framerate" = "Kehysnopeus";

/* (No Comment) */
"Graphics Card" = "Näytönohjain";

/* (No Comment) */
"Help Center" = "Help Center";

/* (No Comment) */
"High Power" = "Suuri Teho";

/* (No Comment) */
"High Resolution (Smaller Text)" = "Suuri Näyttötarkkuus (Pienempi Tekstikoko)";

/* (No Comment) */
"If this is your first time using Duet, macOS requires you to approve Duet to use your mobile device as a second display" = "Jos käytät Duetia ensimmäistä kertaa, macOS edellyttää, että hyväksyt Duetin käyttämään mobiililaitettasi toisena näytönä";

/* (No Comment) */
"Integrated (Energy Savings)" = "Integroitu (Energiatehokas)";

/* (No Comment) */
"Launch At Login" = "Suorita Sisäänkirjautumisen Yhteydessä";

/* Launch Duet On Your Mobile Device To Get A Little More Space For Your Mac */
"Launch Duet On Your Mobile Device To Get A Little More Space For Your Mac" = "Käynnistä Duet mobiililaitteellasi saadaksesi hieman enemmän tilaa Mac-tietokoneellesi";

/* Manage your account here */
"Manage your account for %@ further here." = "Hallinnoi osoitteeseen %@ liitettyä tiliäsi tästä.";

/* No comment provided by engineer. */
"Mirrored For %d Minutes" = "%d minuuttia peilattuna";

/* No comment provided by engineer. */
"Mirrored For 1 Minute" = "1 minuutti peilattuna";

/* No comment provided by engineer. */
"Mirrored For Less Than A Minute" = "Alle minuutti peilattuna";

/* (No Comment) */
"Mobile Device Resolution" = "Mobiililaitteen päätöslauselma";

/* No comment provided by engineer. */
"No" = "No";

/* (No Comment) */
"No Device Connected" = "Laitetta ei ole Liitetty";

/* (No Comment) */
"Open duet on iOS" = "Avaa duet iOS:ssä";

/* (No Comment) */
"Open Duet on your mobile device" = "Avaa Duet mobiililaitteellasi";

/* (No Comment) */
"Open Duet On Your Mobile Device and Plug Into Your Mac Using An Appropriate Certified Cable, And You're Ready To Go!" = "Avaa Duet matkapuhelimellasi ja kytke Mac-tietokoneesi sopivalla sertifioidulla kaapelilla, ja olet valmis lähtemään!";

/* (No Comment) */
"or" = "tai";

/* Password */
"Password" = "Salasana";

/* (No Comment) */
"Performance" = "Suorituskyky";

/* Please connect your Android Device to view or change settings. */
"Please connect your Android Device to view or change settings." = "Tarkastele tai muuta asetuksia yhdistämällä Android-laite.";

/* Please connect your iOS Device to view or change settings. */
"Please connect your iOS Device to view or change settings." = "Tarkastele tai muuta asetuksia yhdistämällä iOS-laite.";

/* (No Comment) */
"Please connect your mobile device to view or change settings" = "Kytke mobiililaitteesi nähdäksesi tai muuttaa asetuksia";

/* (No Comment) */
"Preferences" = "Määritykset";

/* (No Comment) */
"Quality" = "Laatu";

/* (No Comment) */
"Quit" = "Poistu";

/* (No Comment) */
"Regular (Energy Efficient)" = "Tavallinen Näyttötarkkuus (Energiatehokas)";

/* No comment provided by engineer. */
"Remind Me When iPad Is Connected" = "Ilmoita, kun iPad on yhdistetty.";

/* (No Comment) */
"Remind Me When Mobile Device Is Connected" = "Muistuta minua, kun mobiililaite on kytketty";

/* (No Comment) */
"Resolution" = "Näyttötarkkuus";

/* (No Comment) */
"Restart Your Mac" = "Käynnistä Mac-koneesi Uudestaan";

/* (No Comment) */
"Retina (High Performance)" = "Retina-näytön Tarkkuus (Suuri Teho)";

/* (No Comment) */
"Select 'Try Again' to re-try the re-authorize, or 'Quit' to give up." = "Valitse 'Yritä uudestaan' yrittääksesi auktorisointia uudestaan, tai 'Lopeta' poistuaksesi.";

/* No comment provided by engineer. */
"Sharper image." = "Tarkempi resoluutio";

/* No comment provided by engineer. */
"Sharper resolution." = "Tarkempi resoluutio";

/* (No Comment) */
"SignOutTitle" = "Kirjaudu ulos";

/* Smoother motion. */
"Smoother motion." = "Sulavampi liike";

/* (No Comment) */
"Try Again" = "Yritä Uudestaan";

/* Twice the pixel density. */
"Twice the pixel density." = "Tarkempi resoluutio";

/* (No Comment) */
"Uninstall Duet" = "Poista duetin Asennus";

/* (No Comment) */
"Update App Automatically" = "Päivitä Sovellus Automaattisesti";

/* Uses more battery. */
"Uses more battery." = "Kuluttaa enemmän virtaa";

/* (No Comment) */
"Version" = "Versio";

/* (No Comment) */
"When Duet Is Connected..." = "Kun duet on yhdistetty...";

/* No comment provided by engineer. */
"Yes" = "はい";

